#Напишите программу, которая использует ровно три цикла for для печати следующей последовательности символов:

for a1 in range(6):
    print("AAA")
for b1 in range(5):
    print("BBBB")
print("E")
for t1 in range(9):
      print("TTTTT")
print("G")