#Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:
#Hello <введённое имя> <введённая фамилия>! You have just delved into Python

print("Hello", input(), input() + "!", "You have just delved into Python")