#Напишите программу, вычисляющую значение тригонометрического выражения

import math
x = float(input())
r = math.radians(x)
print(math.sin(r) + math.cos(r) + math.tan(r)**2)