#Напишите программу, определяющую площадь круга и длину окружности по заданному радиусу

import math
R = float(input())
print(math.pi * R**2)
print(2 * math.pi * R)